xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/os_dep/windows/xp/recv_xp.c

#define _RECV_OSDEP_C_

#include <drv_conf.h>
#include <osdep_service.h>
#include <drv_types.h>

#include <wifi.h>
#include <rtl8711_regdef.h>
#include <recv_osdep.h>

#include <osdep_intf.h>

#include <usb_ops.h>

#if defined (PLATFORM_LINUX) && defined (PLATFORM_WINDOWS)

#error "Shall be Linux or Windows, but not both!\n"

#endif

#ifdef PLATFORM_WINDOWS
#include "wlan_bssdef.h"
#include <ethernet.h>
#include <if_ether.h>
#include <ip.h>

#endif


//recv_osdep.c

sint	_init_recv_priv(struct recv_priv *precvpriv, _adapter *padapter)
{
	sint i;
	union recv_frame *precvframe;
	NDIS_STATUS	 status;
	sint	res=_SUCCESS;
_func_enter_;		
	memset((unsigned char *)precvpriv, 0, sizeof (struct  recv_priv));

	_spinlock_init(&precvpriv->lock);
	_init_sema(&precvpriv->recv_sema, 0);
	_init_sema(&precvpriv->terminate_recvthread_sema, 0);

	 NdisInitializeEvent(&precvpriv->recv_resource_evt);

	 precvpriv->counter=1;

	for(i=0; i<MAX_RX_NUMBLKS; i++)
		_init_queue(&precvpriv->blk_strms[i]);


	_init_queue(&precvpriv->free_recv_queue);
	_init_queue(&precvpriv->recv_pending_queue);	



	NdisAllocatePacketPoolEx(
		&status,
		&precvpriv->RxPktPoolHdl,
		NR_RECVFRAME,
		NR_RECVFRAME,					//NumberOfOverflowDescriptors 
		sizeof(PVOID) * 4);	//ProtocolReservedLength 

	if(status != NDIS_STATUS_SUCCESS) 
	{
		DEBUG_ERR(("XXX InitializeTxRxBuffer(): NdisAllocatePacketPoolEx() failed\n" ));
		precvpriv->RxPktPoolHdl = NULL;
	}

	NdisAllocateBufferPool(
		&status,
		&precvpriv->RxBufPoolHdl,
		NR_RECVFRAME);
	

	if(status != NDIS_STATUS_SUCCESS) 
	{
		DEBUG_ERR(("XXX InitializeTxRxBuffer(): NdisAllocatePacketPoolEx() failed\n" ));
		precvpriv->RxBufPoolHdl = NULL;
	}



	/*
	remember: 256 aligned
	
	Please allocate memory with the sz = (struct recv_frame) * NR_recvFRAME, 
	and initialize free_recv_frame below.
	Please also link_up all the recv_frames...
	*/

	precvpriv->pallocated_frame_buf = _malloc(NR_RECVFRAME * sizeof(union recv_frame) + RXFRAME_ALIGN_SZ);
	if(precvpriv->pallocated_frame_buf==NULL){
		res= _FAIL;
		goto exit;
	}
	memset(precvpriv->pallocated_frame_buf, 0, NR_RECVFRAME * sizeof(union recv_frame) + RXFRAME_ALIGN_SZ);

	precvpriv->precv_frame_buf = precvpriv->pallocated_frame_buf + RXFRAME_ALIGN_SZ -
							((uint) (precvpriv->pallocated_frame_buf) &(RXFRAME_ALIGN_SZ-1));


	precvframe = (union recv_frame*) precvpriv->precv_frame_buf;

#ifdef CONFIG_USB_HCI	//allocate URB memory

	precvpriv->rx_pending_cnt=1;

	_init_sema(&precvpriv->allrxreturnevt, 0);//NdisInitializeEvent(&precvpriv->allrxreturnevt);
	
	precvpriv->pallocated_urb_buf = _malloc(NR_RECVFRAME * sizeof(URB));
	if(precvpriv->pallocated_urb_buf==NULL){
		DEBUG_ERR(("_init_recv_priv:allocate pallocated_frame_buf  FAILED\n"));		
		return _FAIL;
	}
	precvpriv->pnxtallocated_urb_buf =precvpriv->pallocated_urb_buf ;
#endif

	for(i=0; i < NR_RECVFRAME ; i++)
	{
		_init_listhead(&(precvframe->u.list));

		list_insert_tail(&(precvframe->u.list), &(precvpriv->free_recv_queue.queue));

		NdisAllocatePacket(
				&status,
				&precvframe->u.hdr.pkt,
				precvpriv->RxPktPoolHdl);

		if(status != NDIS_STATUS_SUCCESS)
		{
			DEBUG_ERR(("\n NdisAllocatePacket Fail in _init_recv_priv \n\n"));
			precvframe->u.hdr.pkt = NULL;
		}
#ifdef CONFIG_USB_HCI	
		precvframe->u.hdr.irp_pending=_FALSE;
		precvframe->u.hdr.pirp=IoAllocateIrp(padapter->dvobjpriv.nextdevstacksz, FALSE);
	
		if( precvframe->u.hdr.pirp == NULL)	{
			DEBUG_ERR(("_init_recv_priv: IoAllocateIrp FAILED\n"));	
		//	return _FAIL;
		}
		precvframe->u.hdr.purb=(PURB)precvpriv->pnxtallocated_urb_buf; 
		precvpriv->pnxtallocated_urb_buf += sizeof(URB);
#endif		


            precvframe->u.hdr.adapter =padapter;
		precvframe++;
	}
	
	precvpriv->adapter = padapter;
	precvpriv->free_recvframe_cnt=NR_RECVFRAME;
exit:	
_func_exit_;
	return _TRUE;
	

}

/*
caller of _free_recv_priv have to make sure " NO ONE WILL ACCESS recv_priv "
=>>>>>>down(terminate_recvthread_sema) is true
*/
void _free_recv_priv (struct recv_priv *precvpriv)
{
	uint i;
	union recv_frame *precvframe;
_func_enter_;		

	precvframe = (union recv_frame*) precvpriv->precv_frame_buf;


	for(i=0; i < NR_RECVFRAME ; i++)
	{ 
		// free NdisFreeBuffer
		NdisFreePacket(precvframe->u.hdr.pkt);
		precvframe++;	
	}

	NdisFreeBufferPool(precvpriv->RxBufPoolHdl);
	precvpriv->RxBufPoolHdl = NULL;

	NdisFreePacketPool(precvpriv->RxPktPoolHdl);
	precvpriv->RxPktPoolHdl = NULL;

	if(precvpriv->pallocated_frame_buf)
		_mfree(precvpriv->pallocated_frame_buf, NR_RECVFRAME * sizeof(union recv_frame) + RXFRAME_ALIGN_SZ);

_func_exit_;
}


_pkt * get_os_resource(u8 *bResult)
{
_func_enter_;
	*bResult = _SUCCESS;
	return NULL;
_func_exit_;
}

void free_os_resource(_pkt *pkt)
{
_func_enter_;

_func_exit_;
}


//
//	Description:
//		Handle TKIP MIC error. 
//		For example, indicate the MIC error event to supplicant.
//
void handle_tkip_mic_err(_adapter *padapter,u8 bgroup)
{
	u32			cur_time,cnt=0;
	LARGE_INTEGER	sys_time;
	u32  diff_time ;
	PNDIS_802_11_AUTHENTICATION_EVENT	pauth_evt;
	u8	sz_ary[30];
	struct mlme_priv* pmlmepriv=&padapter->mlmepriv;
	struct security_priv *psecuritypriv=&padapter->securitypriv;

	// Initialize event to indicate up.
	memset(sz_ary, 0,sizeof(sz_ary)); //	NdisZeroMemory(szArray, sizeof(szArray));
	pauth_evt=(PNDIS_802_11_AUTHENTICATION_EVENT)&sz_ary[0];//pAuthEvent = (PAUTHENTICATION_EVENT)&szArray[0];
	pauth_evt->Status.StatusType=Ndis802_11StatusType_Authentication;
	pauth_evt->Request->Length = sizeof(NDIS_802_11_AUTHENTICATION_REQUEST);
	_memcpy(pauth_evt->Request->Bssid, (get_bssid(pmlmepriv)), ETH_ALEN);		//	NdisMoveMemory(pAuthEvent->Request.Bssid, pMgntInfo->Bssid, 6);
		
	
	NdisGetCurrentSystemTime(&sys_time);	
	cur_time=(u32)(sys_time.QuadPart/10);  // In micro-second.
	DEBUG_ERR(("\n handle_tkip_mic_err:cur_time=0x%x\n",cur_time));
	DEBUG_ERR(("\n handle_tkip_mic_err:psecuritypriv->last_mic_err_time=0x%x\n",psecuritypriv->last_mic_err_time));
	diff_time = cur_time -psecuritypriv->last_mic_err_time; // In micro-second.
	DEBUG_ERR(("\n handle_tkip_mic_err:diff_time=0x%x\n",diff_time));

