xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/os_dep/windows/xp/recv_xp.c
	if((bgroup==_TRUE)&&(psecuritypriv->bcheck_grpkey ==_FALSE)){
		DEBUG_ERR((" handle_tkip_mic_err :bgroup=%d psecuritypriv->bcheck_grpkey=%d",bgroup,psecuritypriv->bcheck_grpkey));
		goto exit;
	}
			
	// Indication of MIC error to upper layer.
	pauth_evt->Request->Flags = NDIS_802_11_AUTH_REQUEST_PAIRWISE_ERROR;
	NdisMIndicateStatus(
				padapter->hndis_adapter,
 				NDIS_STATUS_MEDIA_SPECIFIC_INDICATION,
				(PVOID)sz_ary,
				sizeof(NDIS_802_11_STATUS_INDICATION) + sizeof(NDIS_802_11_AUTHENTICATION_REQUEST));
	NdisMIndicateStatusComplete(padapter->hndis_adapter);
	DEBUG_ERR((" ======indicate mic err======"));
	psecuritypriv->btkip_wait_report=_TRUE;
	if(diff_time >60000000) 
	{ // Fisrt MIC Error happend in 60 seconds.
		DEBUG_ERR(("\n handle_tkip_mic_err(): TKIP MIC error.\n"));
		// Update MIC error time.
		psecuritypriv->last_mic_err_time= cur_time;
	}
	else
	{ // Second MIC Error happend in 60 seconds.
		DEBUG_ERR(("\n handle_tkip_mic_err(): Second TKIP MIC error.\n"));
		// Reset MIC error time.
		psecuritypriv->last_mic_err_time= 0;
		psecuritypriv->btkip_countermeasure=_TRUE;
		psecuritypriv->btkip_countermeasure_time=cur_time;
		while(psecuritypriv->btkip_wait_report=_TRUE){
			msleep_os(10);
			cnt++;
			if(cnt>1000)
				break;
		}
		msleep_os(10);
		disassoc_cmd(padapter);
		indicate_disconnect(padapter);
		psecuritypriv->btkip_countermeasure=_TRUE;
		// Set the flag to disassocate AP after MIC failure report send to AP.
	//Sec->bToDisassocAfterMICFailureReportSend = TRUE;
		// Insert current BSSID to denied list.
	//ecInsertDenyBssidList(pSec, pMgntInfo->Bssid, CurrTime);
	}
exit:	
	return;
}


#if 1

u32 blk_read_rxpkt(_adapter *padapter,union recv_frame *precvframe){

	sint rxlen, rxlen_t, remainder;
	struct recv_stat *prxstat;
	u32 pattern = 0xffffffff;
   	uint rx_state = 1;
	u32 ret=_SUCCESS;
	u8 *phead=precvframe->u.hdr.rx_head;
	u8 *pdata=precvframe->u.hdr.rx_data;
	u8 *ptail=precvframe->u.hdr.rx_tail;
	u8 *pend=precvframe->u.hdr.rx_end;   
	struct registry_priv *pregistrypriv = &padapter->registrypriv;
	 struct dvobj_priv *pdevobj=&padapter->dvobjpriv;

	
_func_enter_;			   


	if( (padapter->bDriverStopped ==_TRUE) || (padapter->bSurpriseRemoved == _TRUE)){
		ret= _FAIL;
		goto exit;
	}


	read_port(padapter, Host_R_FIFO, 512, phead);
       prxstat=(struct recv_stat *)phead;//get_recvframe_data(precvframe);  
       
	 if(_memcmp(pdata,&pattern,4) == _TRUE){
		DEBUG_ERR(("####recv 4 bytes of 0xff pkt"));
		ret = state_no_rx_data;
 	     	goto exit;
	}


	rxlen = prxstat->frame_length;	
	
	//notes:update tail before update pdata
	ptail = recvframe_put(precvframe, 16);    
       pdata = recvframe_pull(precvframe, 16);  

	rxlen_t = (rxlen < 496) ? rxlen : 496;
	ptail = recvframe_put(precvframe, rxlen_t); 
	rxlen -= rxlen_t;   

	rxlen_t = (rxlen >> 9) << 9;
	remainder = rxlen - rxlen_t;
	if(remainder) rxlen_t += 512;

	while(rxlen > 0)
	{
              if( rxlen_t > (sint)(pend-ptail) )
              {
             	DEBUG_ERR(("!!!! Rx pkt's len too large  = %x ;will drop pkt!!!!", rxlen_t));
                   rxlen_t = pend-ptail;
                   read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);	
			
                   //don't update tail;
                   rxlen -= rxlen_t;                    				   
		      ret=_FAIL;
              }
	       else
		{
		     read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);
		    //update tail
		    ptail = recvframe_put(precvframe, rxlen);	
		    rxlen = 0;	
	       }
	}
_func_exit_;	
exit:
	return ret;
}


u32 byte_read_rxpkt(_adapter *padapter,union recv_frame *precvframe){
	
	sint rxlen, rxlen_t, remainder;
	struct recv_stat *prxstat;
	u32 ret=_SUCCESS;
	u8 *phead=precvframe->u.hdr.rx_head;
	u8 *pdata=precvframe->u.hdr.rx_data;
	u8 *ptail=precvframe->u.hdr.rx_tail;
	u8 *pend=precvframe->u.hdr.rx_end;   
_func_enter_;	
       //read 16 bytes rx status
	read_port(padapter, Host_R_FIFO, 16, phead);  
       prxstat=(struct recv_stat *)phead;
	


	//get frame length	from rx status
	rxlen = prxstat->frame_length;	
		 
	//notes:update tail before update pdata
	ptail = recvframe_put(precvframe, 16);
       pdata = recvframe_pull(precvframe, 16);	
		
	
	//start to rd rxdata
	rxlen_t = (rxlen < 496) ? rxlen : 496;
	read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);

       //update tail
       ptail = recvframe_put(precvframe, rxlen_t);
	rxlen -= rxlen_t;

	while(rxlen > 0)
	{
              if( rxlen > (sint)(pend-ptail) )
              {
                   rxlen_t = pend-ptail;
                   read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);	

                   //don't update tail;		   
                   rxlen -= rxlen_t;                    				   
		     ret=_FAIL;
              }
	       else
		{
		     read_port(padapter,  Host_R_FIFO, rxlen, ptail);
		    //update tail
		    ptail = recvframe_put(precvframe, rxlen);		
		    rxlen = 0;	
	       }
	}

_func_exit_;	
	return ret;
}

s32 recv_entry( IN _nic_hdl	cnxt){
	_irqL irqL;
	_adapter *padapter;
	struct recv_priv *precvpriv;
	struct	mlme_priv	*pmlmepriv ;
	 struct dvobj_priv *pdev;
	struct registry_priv *registry_par;
	union recv_frame *precvframe; 
	struct recv_stat *prxstat; 
	 u8 *phead, *pdata, *ptail,*pend;    
	 uint bufferlen;
	_queue *pfree_recv_queue, *ppending_recv_queue;
	u8 blk_mode = _FALSE;
	s32 ret=_SUCCESS;
	NDIS_STATUS	 status=NDIS_STATUS_SUCCESS;
	struct intf_hdl * pintfhdl;

_func_enter_;		

#ifdef CONFIG_SDIO_HCI
		padapter=(_adapter *)cnxt;   
#else  //for usb
	precvframe=(union recv_frame *)cnxt;
	padapter=precvframe->u.hdr.adapter;
	pintfhdl=&padapter->pio_queue->intf;
#endif

	pmlmepriv = &padapter->mlmepriv;
	precvpriv = &(padapter->recvpriv);
	pdev=&padapter->dvobjpriv;
	registry_par = &(padapter->registrypriv);
	pfree_recv_queue = &(precvpriv->free_recv_queue);
	ppending_recv_queue = &(precvpriv->recv_pending_queue);


#ifdef CONFIG_SDIO_HCI		
	
	//dequeue
	precvframe = alloc_recvframe(pfree_recv_queue);	

       if (precvframe == NULL)
       {    
       	DEBUG_ERR(("alloc_recvframe failed!!"));
       	goto _recv_entry_drop;      
       }
	   
	
	//init recv_frame
	init_recvframe(precvframe, precvpriv);     

	if ((registry_par->chip_version >= RTL8711_3rdCUT) || (registry_par->chip_version == RTL8711_FPGA))
	{
		if(pdev->block_mode==1) 
	{
		#ifdef RD_BLK_MODE 
		blk_mode = _TRUE;
		#endif
	}   
	}   

	if(blk_mode)
		ret=blk_read_rxpkt(padapter,precvframe);
	
	else
		ret=byte_read_rxpkt(padapter,precvframe);

