xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/os_dep/windows/xp/recv_xp.c
	if((ret==_FAIL) || (ret==state_no_rx_data))
		goto _recv_entry_drop; 
	
#endif	

	phead=precvframe->u.hdr.rx_head;
	pdata=precvframe->u.hdr.rx_data;
	ptail=precvframe->u.hdr.rx_tail;
	pend=precvframe->u.hdr.rx_end;  
	prxstat=(struct recv_stat *)phead;
	
#ifdef CONFIG_MP_INCLUDED	
       if ((check_fwstate(pmlmepriv, WIFI_MP_STATE) == _TRUE)// && 
	   	/*(check_fwstate(pmlmepriv, WIFI_MP_LPBK_STATE) != _TRUE)*/ )	   	
       {
           padapter->mppriv.rx_pktcount++;
		   
           if(prxstat->crc32)
		padapter->mppriv.rx_crcerrpktcount++;
		
           _memcpy(&padapter->mppriv.rxstat, prxstat, sizeof(struct recv_stat));
       }
	   
#endif	

       //remove 4 bytes FCS
       ptail = recvframe_pull_tail(precvframe, 4);	
       bufferlen = ptail -pdata;
	
       //todo: check frame length, get len by using macro
       if(precvframe->u.hdr.len != (prxstat->frame_length-4))
      {
                 DEBUG_ERR(("recv_entry:%d, %d\n", precvframe->u.hdr.len, prxstat->frame_length));
		   ret = _FAIL;		 
		   goto _recv_entry_drop;
	}

	if((prxstat->decrypted==1)&&(prxstat->icv==1))
	{
		DEBUG_ERR(("prxstat->icv=%d  Drop packet",prxstat->icv));
		if(padapter->securitypriv.dot11PrivacyAlgrthm!=_AES_){
			//	DbgPrint("prxstat->decrypted =%d prxstat->icv=%d  Drop packet",prxstat->decrypted,prxstat->icv);
			//	DbgPrint("prxstat->frag =%d mfrag=0x%.2x ",prxstat->frag,*(pdata+1));
			ret = _FAIL;		 
		   	goto _recv_entry_drop;
		}
	}

       //todo: check if  free_recv_queue is empty after dequeue one 
       //        if yes, enqueue back to  free_recv_queue after read hw rx fifo data, and reuse ndispacket
#ifdef CONFIG_USB_HCI
	_enter_critical(&ppending_recv_queue->lock, &irqL);

	if(_queue_empty(ppending_recv_queue) == _TRUE) {
		//enqueue to recv_pending_queue
		enqueue_recvframe_usb(precvframe, ppending_recv_queue);
		_up_sema(&precvpriv->recv_sema);
	}
	else 
		//enqueue to recv_pending_queue
		enqueue_recvframe_usb(precvframe, ppending_recv_queue);
	
	_exit_critical(&ppending_recv_queue->lock, &irqL);
#else
	if(precvpriv->free_recvframe_cnt >1){
#ifdef  use_recv_func	
	  recv_func(padapter, precvframe);
#else
          //enqueue to recv_pending_queue
	   enqueue_recvframe(precvframe, ppending_recv_queue);
		  
          //todo: _up_sema in caller
	   _up_sema(&precvpriv->recv_sema);          
#endif	
	   precvpriv->rx_pkts++;       
	}
	else
		goto _recv_entry_drop;
#endif
_func_exit_;		
	   return ret;

	
_recv_entry_drop:

#ifdef	CONFIG_USB_HCI
	usb_read_port(pintfhdl, 0, 0, (unsigned char *)precvframe);
#else
	if(precvframe)//enqueue back to  free_recv_queue
		free_recvframe(precvframe, pfree_recv_queue);
#endif

	precvpriv->rx_drop++;	
#ifdef CONFIG_MP_INCLUDED	
	padapter->mppriv.rx_pktloss = precvpriv->rx_drop;
#endif
       DEBUG_ERR(("_recv_entry_drop\n"));
_func_exit_;	
	return ret;

}



#else


//#ifndef RD_BLK_MODE 
NDIS_STATUS recv_entry_byte_md( IN _nic_hdl	cnxt)	
{


	 struct recv_priv *precvpriv;
       _queue *pfree_recv_queue, *ppending_recv_queue;	
       union recv_frame *precvframe;       
       u8 *phead, *pdata, *ptail,*pend;      
	struct recv_stat *prxstat; 
	uint rxlen, bufferlen, rxlen_t;
	NDIS_STATUS	 status=NDIS_STATUS_SUCCESS;
	_adapter *padapter=(_adapter *)cnxt;       
	struct	mlme_priv	*pmlmepriv = &padapter->mlmepriv;
       u8 bdrop=_FALSE;		
       

_func_enter_;		

	precvpriv = &(padapter->recvpriv);


	pfree_recv_queue = &(precvpriv->free_recv_queue);
	ppending_recv_queue = &(precvpriv->recv_pending_queue);
	
	//dequeue
	precvframe = alloc_recvframe(pfree_recv_queue);
       if (precvframe == NULL)
       {    
       	DEBUG_INFO(("alloc_recvframe failed!!"));
       	goto _recv_entry_drop;      
       }
	   
	
	//init recv_frame
	init_recvframe(precvframe, precvpriv);     

	phead=precvframe->u.hdr.rx_head;
       pdata=precvframe->u.hdr.rx_data;
       ptail=precvframe->u.hdr.rx_tail;
       pend=precvframe->u.hdr.rx_end;  

	
       //read 16 bytes rx status
	read_port(padapter, Host_R_FIFO, 16, phead);  
       prxstat=(struct recv_stat *)get_recvframe_data(precvframe);
	
       //update_rxstatus(padapter, precvframe, prxstat );
#ifdef CONFIG_MP_INCLUDED	
       if ((check_fwstate(pmlmepriv, WIFI_MP_STATE) == _TRUE)// && 
	   	/*(check_fwstate(pmlmepriv, WIFI_MP_LPBK_STATE) != _TRUE)*/ )	   	
       {
           padapter->mppriv.rx_pktcount++;
		   
           if(prxstat->crc32)
		padapter->mppriv.rx_crcerrpktcount++;

           _memcpy(&padapter->mppriv.rxstat, prxstat, sizeof(struct recv_stat));

           //DEBUG_ERR("mp_mode:recv_entry()\n");		   

           //goto _recv_entry_drop;	    
       }
	   
#endif	

	//get frame length	from rx status
	rxlen = prxstat->frame_length;	
		 
	//notes:update tail before update pdata
	ptail = recvframe_put(precvframe, 16);
       pdata = recvframe_pull(precvframe, 16);	      
		
	
	//start to rd rxdata
	rxlen_t = (rxlen < 496) ? rxlen : 496;
	read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);

       //update tail
       ptail = recvframe_put(precvframe, rxlen_t);
	rxlen -= rxlen_t;

	while(rxlen > 0)
	{
              if( rxlen > (unsigned int)(pend-ptail) )
              {
                   rxlen_t = pend-ptail;
                   read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);	

                   //don't update tail;		   
                   rxlen -= rxlen_t;                    				   
		     bdrop=_TRUE;
              }
	       else
		{
		     read_port(padapter,  Host_R_FIFO, rxlen, ptail);
		    //update tail
		    ptail = recvframe_put(precvframe, rxlen);		
		    rxlen = 0;	
	       }
	}

	/* Perry:
		If we receive packet which more = 0, it means we can push driver to sleep mode.
		Also, we must make sure that 
	*/
	if (prxstat->mdata == 0)
		unregister_rx_alive(padapter);

	if(bdrop==_TRUE)
	     goto _recv_entry_drop;

       //remove 4 bytes FCS
       ptail = recvframe_pull_tail(precvframe, 4);	
       bufferlen = ptail -pdata;
	
       //todo: check frame length, get len by using macro
       if(precvframe->u.hdr.len != (prxstat->frame_length-4))
      {
                 DEBUG_ERR(("recv_entry:%d, %d\n", precvframe->u.hdr.len, prxstat->frame_length));
		   goto _recv_entry_drop;
	}
       //     goto _recv_entry_drop;	   
	//todo:check if ptail > pend 	

      //if ((if_up((unsigned char*)padapter)) == _FALSE)
      //     goto _recv_entry_drop;

