xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/os_dep/windows/xp/recv_xp.c
       //todo: check if  free_recv_queue is empty after dequeue one 
       //        if yes, enqueue back to  free_recv_queue after read hw rx fifo data, and reuse ndispacket

	if(precvpriv->free_recvframe_cnt >1){
          //enqueue to recv_pending_queue
	   enqueue_recvframe(precvframe, ppending_recv_queue);
		  
          //todo: _up_sema in caller
	   _up_sema(&precvpriv->recv_sema);          
	
	   precvpriv->rx_pkts++;       
	}
	else
		goto _recv_entry_drop;
_func_exit_;		
	   return ret;

	
_recv_entry_drop:


	if(precvframe)//enqueue back to  free_recv_queue
		free_recvframe(precvframe, pfree_recv_queue);

	precvpriv->rx_drop++;	
#ifdef CONFIG_MP_INCLUDED	
	padapter->mppriv.rx_pktloss = precvpriv->rx_drop;
#endif
       DEBUG_ERR(("_recv_entry_drop\n"));
_func_exit_;	
	return status;

}



//#else

//while(_Rdy || (SdioDevice->RXPktCount > 0))
//_up_sema(&precvpriv->recv_sema);
NDIS_STATUS recv_entry_blk_md( IN _nic_hdl	cnxt)	
{


	 struct recv_priv *precvpriv;
       _queue *pfree_recv_queue, *ppending_recv_queue;	
       union recv_frame *precvframe = NULL;       
       u8 *phead, *pdata, *ptail,*pend;      
	struct recv_stat *prxstat; 
	uint rxlen, bufferlen, rxlen_t, remainder;
	NDIS_STATUS	 status=NDIS_STATUS_SUCCESS;
	_adapter *padapter=(_adapter *)cnxt;       
	struct	mlme_priv	*pmlmepriv = &padapter->mlmepriv;
       u8 bdrop=_FALSE;		
    	u32 pattern = 0xffffffff;
   	uint rx_state = 1;


_func_enter_;		

	precvpriv = &(padapter->recvpriv);

	pfree_recv_queue = &(precvpriv->free_recv_queue);
	ppending_recv_queue = &(precvpriv->recv_pending_queue);
	
	//dequeue
	precvframe = alloc_recvframe(pfree_recv_queue);
       if (precvframe == NULL)
       {    
       	DEBUG_INFO(("alloc_recvframe failed!!"));
       	goto _recv_entry_drop;      
       }
	   	
	//init recv_frame
	init_recvframe(precvframe, precvpriv);     

	phead=precvframe->u.hdr.rx_head;
       pdata=precvframe->u.hdr.rx_data;
       ptail=precvframe->u.hdr.rx_tail;
       pend=precvframe->u.hdr.rx_end;  

	
	 read_port(padapter, Host_R_FIFO, 512, phead);
       prxstat=(struct recv_stat *)phead;//get_recvframe_data(precvframe);
       
	 if(_memcmp(pdata,&pattern,4) == _TRUE){
	 	rx_state = state_no_rx_data;
		DEBUG_ERR(("~~~recv 4 bytes of 0xff pkt"));
		/*if(_memcmp(pdata+4,&pattern,4) == _FALSE)
		{
			write32(padapter, SCRAM0, 0);
			DEBUG_ERR(("#############however the4~7 bytes is not 0xff"));
		}*/
 	     	goto _recv_entry_drop;
	}


	rxlen = prxstat->frame_length;	
	
	//notes:update tail before update pdata
	ptail = recvframe_put(precvframe, 16);
       pdata = recvframe_pull(precvframe, 16);

	rxlen_t = (rxlen < 496) ? rxlen : 496;
	ptail = recvframe_put(precvframe, rxlen_t);
	rxlen -= rxlen_t;   

	rxlen_t = (rxlen >> 9) << 9;
	remainder = rxlen - rxlen_t;
	if(remainder) rxlen_t += 512;

	while(rxlen > 0)
	{
              if( rxlen_t > (unsigned int)(pend-ptail) )
              {
             	DEBUG_ERR(("!!!! Rx pkt's len too large  = %x ;will drop pkt!!!!", rxlen_t));
                   rxlen_t = pend-ptail;
                   read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);	
			
                   //don't update tail;
                   rxlen -= rxlen_t;                    				   
		      bdrop=_TRUE;
              }
	       else
		{
		     read_port(padapter,  Host_R_FIFO, rxlen_t, ptail);
		    //update tail
		    ptail = recvframe_put(precvframe, rxlen);	
		    rxlen = 0;	
	       }
	}

	/* Perry:
		If we receive packet which more = 0, it means we can push driver to sleep mode.
		Also, we must make sure that 
	*/
	if (prxstat->mdata == 0)
		unregister_rx_alive(padapter);

	if(bdrop==_TRUE)
	     goto _recv_entry_drop;

       //remove 4 bytes FCS
       ptail = recvframe_pull_tail(precvframe, 4);	
       bufferlen = ptail -pdata;
	
       //todo: check frame length, get len by using macro
       if(precvframe->u.hdr.len != (prxstat->frame_length-4))
      {
            DEBUG_ERR(("recv_entry:%d, %d\n", precvframe->u.hdr.len, prxstat->frame_length));
		goto _recv_entry_drop;
	}
       //     goto _recv_entry_drop;
	//todo:check if ptail > pend 	

      //if ((if_up((unsigned char*)padapter)) == _FALSE)
      //     goto _recv_entry_drop;

       //todo: check if  free_recv_queue is empty after dequeue one 
       //        if yes, enqueue back to  free_recv_queue after read hw rx fifo data, and reuse ndispacket

	if(precvpriv->free_recvframe_cnt >1){
          //enqueue to recv_pending_queue
	   enqueue_recvframe(precvframe, ppending_recv_queue);
		  
          //todo: _up_sema in caller
	   _up_sema(&precvpriv->recv_sema);          
	
	   precvpriv->rx_pkts++;       	
	}
	else
		goto _recv_entry_drop;
_func_exit_;
	   return status;

	
_recv_entry_drop:


	if(precvframe)//enqueue back to  free_recv_queue
		free_recvframe(precvframe, pfree_recv_queue);

	precvpriv->rx_drop++;	
#ifdef CONFIG_MP_INCLUDED	
	padapter->mppriv.rx_pktloss = precvpriv->rx_drop;
#endif
       DEBUG_ERR(("_recv_entry_drop\n"));
_func_exit_;	
	return status;

}


NDIS_STATUS recv_entry( IN _nic_hdl	cnxt)
{
	_adapter *padapter=(_adapter *)cnxt;       
	 struct dvobj_priv *psddev=&padapter->dvobjpriv;
	struct registry_priv *registry_par = &(padapter->registrypriv);
	u8 blk_mode = _FALSE;
	if ((registry_par->chip_version >= RTL8711_3rdCUT) && (psddev->block_mode==1) )
	{
		#ifdef RD_BLK_MODE 
		blk_mode = _TRUE;
		#endif
	}


	if(blk_mode)
		return recv_entry_blk_md(cnxt)	;
	else
		return recv_entry_byte_md(cnxt)	;

}

#endif

void recv_indicatepkt(_adapter *padapter, union recv_frame *precv_frame, _pkt *pkt)
{
	_irqL	irqL;
	struct recv_priv *precvpriv;
	_queue	*pfree_recv_queue;		
	unsigned char *pdata;      
	unsigned int bufferlen;
	_pkt *precv_ndispkt;
	struct iphdr *piphdr;
	struct ethhdr *pethhdr;
	u8 bfreed=_FALSE;
	NDIS_STATUS	 status=NDIS_STATUS_SUCCESS;
	_buffer *pndisbuffer=NULL;
	_pkt *pndispkt_free=NULL;	
_func_enter_;
	precvpriv = &(padapter->recvpriv);	
	pfree_recv_queue = &(precvpriv->free_recv_queue);	
	pdata=get_recvframe_data(precv_frame);	
	bufferlen=precv_frame->u.hdr.len;
	precv_ndispkt=precv_frame->u.hdr.pkt;	

        //check if precv_frame->u.hdr.pkt == NULL
	if(precv_ndispkt == NULL)
	{
		status=NDIS_STATUS_RESOURCES ;
		DEBUG_ERR(("recv_indicatepkt():failed to allocate NdisPacket!\n"));
		goto _recv_indicatepkt_drop;
	}

	NDIS_SET_PACKET_HEADER_SIZE(precv_ndispkt, NIC_HEADER_SIZE);
	    
