xtreamerdev/linux-xtr/drivers/net/wireless/realtek/rtl8709/os_dep/windows/xp/recv_xp.c
	NdisAllocateBuffer(&status,
	                           &pndisbuffer,
	                           precvpriv->RxBufPoolHdl,
	                           (void*)pdata,
	                           bufferlen);

	if(status != NDIS_STATUS_SUCCESS)
	{
	    DEBUG_ERR(("recv_indicatepkt():failed to allocate NdisBuffer!\n"));
	    goto _recv_indicatepkt_drop;
	}

	NdisChainBufferAtBack(precv_ndispkt, pndisbuffer);                         
	
	pethhdr = (struct ethhdr *)pdata;
	
	piphdr = (struct iphdr *)(pdata + 14);
	if(precvpriv->rx_pending_cnt<5) {
		NDIS_SET_PACKET_STATUS(precv_ndispkt, NDIS_STATUS_RESOURCES);	
		bfreed=_TRUE;
	}
	else {
		NDIS_SET_PACKET_STATUS(precv_ndispkt, NDIS_STATUS_SUCCESS);
	}

	_enter_critical(&precvpriv->lock, &irqL);
	precvpriv->counter++;
	_exit_critical(&precvpriv->lock, &irqL);
    
	NdisMIndicateReceivePacket(padapter->hndis_adapter, &precv_ndispkt, 1); 
	if(bfreed==_TRUE)
		recv_returnpacket(padapter, precv_ndispkt);
_func_exit_;		
        return;		

_recv_indicatepkt_drop:

#ifdef CONFIG_USB_HCI
        usb_read_port(pintfhdl,0,0,(unsigned char *)precv_frame);
#else
        //todo: enqueue back to free_recv_queue 
        if(precv_frame)
                free_recvframe(precv_frame, pfree_recv_queue);
#endif
	 
	precvpriv->rx_drop++;		
_func_exit_;
}

void recv_returnpacket(IN _nic_hdl cnxt, IN _pkt *preturnedpkt)
{
	_irqL irqL;

       struct recv_priv *precvpriv;
       _queue	*pfree_recv_queue;
       union recv_frame *precv_frame_returned;	
	_adapter *padapter= (_adapter *)cnxt;
	_buffer *pndisbuffer=NULL;
	struct intf_hdl * pintfhdl=&padapter->pio_queue->intf;
_func_enter_;       
	precvpriv = &(padapter->recvpriv);	
	pfree_recv_queue = &(precvpriv->free_recv_queue);

	//get recv_frame		
	precv_frame_returned = pkt_to_recvframe(preturnedpkt);	
		
	do{
		NdisUnchainBufferAtFront(preturnedpkt, &pndisbuffer);
		if(pndisbuffer==NULL)
			break;
		NdisFreeBuffer(pndisbuffer);
	}while(_TRUE);

	//NdisFreePacket(preturnedpkt);

#ifdef CONFIG_USB_HCI
	//after packet return, submit urb
	usb_read_port(pintfhdl,0, 0, (unsigned char *)precv_frame_returned);
#else
	//todo: enqueue back to free_recv_queue	 	
       free_recvframe(precv_frame_returned, pfree_recv_queue);
#endif

	 _enter_critical(&precvpriv->lock, &irqL);
               
		precvpriv->counter--;
	
		if(precvpriv->counter==0)			
		{
			NdisSetEvent(&precvpriv->recv_resource_evt);
		}

	 _exit_critical(&precvpriv->lock, &irqL);
_func_exit_;

}

void alloc_os_rxpkt(union recv_frame *precvframe ,struct recv_priv *precvpriv)
{
	NDIS_STATUS		status;
_func_enter_;
	if(precvframe->u.hdr.pkt == NULL)
	{
		DEBUG_ERR(("Error: pkt==NULL\n\n"));
		NdisAllocatePacket(
				&status,
				&precvframe->u.hdr.pkt,
				&precvpriv->RxPktPoolHdl);

		if(status != NDIS_STATUS_SUCCESS)
		{
			DEBUG_ERR(("Error: pkt==NULL\n\n"));
			precvframe->u.hdr.pkt = NULL;
		}
	}
	
	precvframe->u.hdr.len=0;
	
	precvframe->u.hdr.rx_head = precvframe->u.hdr.rx_data = precvframe->u.hdr.rx_tail 
				= (u8*)precvframe +  RECVFRAME_HDR_ALIGN;

	precvframe->u.hdr.rx_end = (u8*)precvframe + MAX_RXSZ; 
		
_func_exit_;
}

